{
  "Constellations": [
    {
      "name": "Albedo",

      "c1": {
        "name": "Flower Of Eden",
        "effect": "Transient Blossoms generated by Albedo's Abiogenesis: Solar Isotoma regenerate 1.2 Energy for Albedo."
      },
      "c2": {
        "name": "Opening Of Phanerozoic",
        "effect": "Transient Blossoms generated by Abiogenesis: Solar Isotoma grant Albedo Fatal Reckoning for 30s:\n*Unleashing Rite of Progeniture: Tectonic Tide consumes all stacks of Fatal Reckoning. Each stack of Fatal Reckoning consumed increases DMG dealt by Fatal Blossoms and Rite of Progeniture: Tectonic Tide's burst DMG by 30% of Albedo's DEF.\n*The effect stacks up to 4 times."
      },
      "c3": {
        "name": "Grace Of Helios",
        "effect": "Increases the level of Abiogenesis: Solar Isotoma by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Descent Of Divinity",
        "effect": "Solar Isotoma increases Plunging Attack DMG by 30% for active party members within the AoE."
      },
      "c5": {
        "name": "Tide Of Hadean",
        "effect": "Increases the level of Rite of Progeniture: Tectonic Tide by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Domain Of Purification",
        "effect": "If active party members within the AoE are protected by a shield created by Crystallize, Solar Isotoma increases their DMG by 17%."
      }
    },
    {
      "name": "Amber",
      "c1": {
        "name": "One Arrow to Rule Them All",
        "effect": "Fires 2 arrows per Aimed Shot. The second arrow deals 20% of the first arrow's DMG.\nThe second arrow is fired 10 degrees vertically below actual aiming, has separate critical, and also makes the primary shot travel further before it starts dropping down."
      },
      "c2": {
        "name": "Bunny Triggered",
        "effect": "Baron Bunny, new and improved! Hitting Baron Bunny's foot with a fully-charged Aimed Shot manually detonates it.\nExplosion via manual detonation deals 200% additional DMG."
      },
      "c3": {
        "name": "It Burns!",
        "effect": "Increases the level of Fiery Rain by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "It's Not Just Any Doll...",
        "effect": "Decreases Explosive Puppet's CD by 20%. Adds 1 additional charge."
      },
      "c5": {
        "name": "It's Baron Bunny!",
        "effect": "Increases the level of Explosive Puppet by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Wildfire",
        "effect": "Fiery Rain increases the entire party's Movement SPD by 15% and ATK by 15% for 10s."
      }
    },
    {
      "name": "Ayaka",
      "c1": null,
      "c2": null,
      "c3": null,
      "c4": null,
      "c5": null,
      "c6": null
    },
    {
      "name": "Barbara",
      "c1": {
        "name": "Gleeful Songs",
        "effect": "Barbara regenerates 1 Energy every 10s."
      },
      "c2": {
        "name": "Vitality Burst",
        "effect": "Decreases the CD of Let the Show Begin by 15%. During the ability's duration, your active character gains 15% Hydro DMG Bonus."
      },
      "c3": {
        "name": "Star of Tomorrow",
        "effect": "Increases the level of Shining Miracle by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Attentiveness be My Power",
        "effect": "Every opponent Barbara hits with her Charged Attack regenerates 1 Energy for her. A maximum of 5 energy can be regenerated in this manner with any one Charged Attack."
      },
      "c5": {
        "name": "The Purest Companionship",
        "effect": "Increases the level of Let the Show Begin by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Dedicating Everything to You",
        "effect": "When Barbara is not on the field, and one of your characters in the party falls:\n*Automatically revives this character.\n*Fully regenerates this character's HP to 100%.\nThis effect can only occur once every 15 mins."
      }
    },
    {
      "name": "Beidou",
      "c1": {
        "name": "Sea Beast's Scourge",
        "effect": "When Stormbreaker is used: Creates a shield that absorbs up to 16% of Beidou's Max HP for 15s. This shield absorbs Electro DMG 250% more effectively."
      },
      "c2": {
        "name": "Upon the Turbulent Sea, the Thunder Arises",
        "effect": "Stormbreaker's arc lightning can jump to 2 additional targets."
      },
      "c3": {
        "name": "Summoner of Storm",
        "effect": "Increases the level of Tidecaller by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Stunning Revenge",
        "effect": "Within 10s of taking DMG, Beidou's Normal Attacks gain 20% additional Electro DMG."
      },
      "c5": {
        "name": "Crimson Tidewalker",
        "effect": "Increases the level of Stormbreaker by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Bane of the Evil",
        "effect": "During the duration of Stormbreaker, the Electro RES of surrounding opponents is decreased by 15%."
      }
    },
    {
      "name": "Bennett",
      "c1": {
        "name": "Grand Expectation",
        "effect": "Fantastic Voyage's ATK increase no longer has an HP restriction, and gains an additional 20% of Bennett's Base ATK. (Additive increase)"
      },
      "c2": {
        "name": "Impasse Conqueror",
        "effect": "When HP falls below 70%, increases Energy Recharge by 30%."
      },
      "c3": {
        "name": "Unstoppable Fervor",
        "effect": "Increases Passion Overload's skill level by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Unexpected Odyssey",
        "effect": "Short hold to release Passion Overload as a two-stage attack. Press the attack button to perform an additional falling attack."
      },
      "c5": {
        "name": "True Explorer",
        "effect": "Increases Fantastic Voyage's skill level by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Fire Ventures with Me",
        "effect": "Sword, Claymore, or Polearm-wielding characters inside Fantastic Voyage's radius gain a 15% Pyro DMG Bonus and their weapons are infused with Pyro."
      }
    },
    {
      "name": "Chongyun",
      "c1": {
        "name": "Ice Unleashed",
        "effect": "The last attack of Chongyun's Normal Attack combo releases 3 ice blades. Each blade deals 50% of Chongyun's ATK as Cryo DMG to all opponents in its path."
      },
      "c2": {
        "name": "Atmospheric Revolution",
        "effect": "Elemental Skills and Elemental Bursts cast within the Frost Field created by Spirit Blade: Chonghua's Layered Frost have their CD time decreased by 15%."
      },
      "c3": {
        "name": "Cloudburst",
        "effect": "Increases the level of Spirit Blade: Cloud-Parting Star by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Frozen Skies",
        "effect": "Chongyun regenerates 1 Energy every time he hits an opponent affected by Cryo. This effect can only occur once every 2s."
      },
      "c5": {
        "name": "The True Path",
        "effect": "Increases the level of Spirit Blade: Chonghua's Layered Frost by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Rally of Four Blades",
        "effect": "Spirit Blade: Cloud-Parting Star deals 15% more DMG to opponents with a lower percentage of their Max HP remaining than Chongyun. This skill will also summon 1 additional spirit blade."
      }
    },
    {
      "name": "Diluc",
      "c1": {
        "name": "Conviction",
        "effect": "Diluc deals 15% more DMG to opponents whose HP is above 50%."
      },
      "c2": {
        "name": "Searing Ember",
        "effect": "When Diluc takes DMG, his ATK increases by 10%, and his ATK SPD increases by 5%. Last for 10s.\nThis effect can stack up to 3 times and can only occur once every 1.5s."
      },
      "c3": {
        "name": "Fire and Steel",
        "effect": "Increases Searing Onslaught's skill level by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Flowing Flame",
        "effect": "Casting Searing Onslaught in sequence greatly increases damage dealt.\nWithin 2s of using Searing Onslaught, casting the next Searing Onslaught in the combo deals 40% additional DMG. This effect lasts for the next 2s."
      },
      "c5": {
        "name": "Phoenix, Harbinger of Dawn",
        "effect": "Increases Dawn's skill level by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Flaming Sword, Nemesis of Dark",
        "effect": "After casting Searing Onslaught, the next 2 Normal Attacks within the next 6s will have their DMG and ATK SPD increased by 30%.\nAdditionally, Searing Onslaught will not interrupt the Normal Attack combo"
      }
    },
    {
      "name": "Diona",
      "c1": {
        "name": "A Lingering Flavor",
        "effect": "Regenerates 15 Energy for Diona after the effects of Signature Mix end."
      },
      "c2": {
        "name": "Shaken, Not Purred",
        "effect": "Increases Icy Paws' DMG by 15%, and increases its shield's DMG Absorption by 15%. Additionally, when paws hit their targets, creates a shield for other nearby characters on the field with 50% of the Icy Paws shield's DMG Absorption for 5s."
      },
      "c3": {
        "name": "A-Another Round?",
        "effect": "Increases the Level of Signature Mix by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Wine Industry Slayer",
        "effect": "Within the radius of Signature Mix, Diona's charge time for aimed shots is reduced by 60%."
      },
      "c5": {
        "name": "Double Shot, On The Rocks",
        "effect": "Increases the Level of Icy Paws by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Cat's Tail Closing Time",
        "effect": "Characters within Signature Mix's radius will gain the following effects based on their HP amounts:\n*Increases Incoming Healing Bonus by 30% when HP falls below or is equal to 50%.\n*Elemental Mastery increased by 200 when HP is above 50%."
      }
    },
    {
      "name": "Fischl",
      "c1": {
        "name": "Gaze of the Deep",
        "effect": "Even when Oz is not present in combat, he can still watch over Fischl through the crow's eyes. When Fischl attacks an opponent, Oz fires a joint attack through the crow's eyes, dealing 22% of ATK DMG.\nNote: The additional attack is fired from the orb near Fischl's shoulder and is only fired on normal attacks that have locked on to an enemy, regardless if it is blocked by obstacles or missed. The attack has slight homing and may bypass obstacles."
      },
      "c2": {
        "name": "Devourer of All Sins",
        "effect": "When Nightrider is used, it deals an additional 200% ATK as DMG, and its AoE is increased by 50%."
      },
      "c3": {
        "name": "Wings of Nightmare",
        "effect": "Increases Nightrider's skill level by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Her Pilgrimage of Bleak",
        "effect": "When Midnight Phantasmagoria is used, deals 222% of ATK as Electro DMG to surrounding opponents. When the skill duration ends, Fischl recovers 20% of her HP."
      },
      "c5": {
        "name": "Against the Fleeing Light",
        "effect": "Increases Midnight Phantasmagoria's skill level by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Evernight Raven",
        "effect": "Increases the duration of Oz's summoning by 2s. Additionally, Oz attacks with your active character when present, dealing 30% of Fischl's ATK as Electro DMG."
      }
    },
    {
      "name": "Ganyu",
      "c1": {
        "name": "Dew-Drinker",
        "effect": "Taking DMG from a Charge Level 2 Frostflake Arrow or Frostflake Arrow Bloom decreases opponents' Cryo RES by 15% for 6s.\nA hit regenerates 2 Energy for Ganyu. This effect can only occur once per Charge Level Frostflake Arrow, regardless if Frostflake Arrow itself or its Bloom hit the target."
      },
      "c2": {
        "name": "The Auspicious",
        "effect": "Trail of the Qilin gains 1 additional charge."
      },
      "c3": {
        "name": "Cloud-Strider",
        "effect": "Increases the Level of Celestial Shower by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Westward Sojourn",
        "effect": "Opponents standing within the AoE of Celestial Shower take increased DMG. This effect strengthens over time. Increased DMG taken begins at 5% and increases by 5% every 3s, up to a maximum of 25%.\nThe effect lingers for 3s after the opponent leaves the AoE."
      },
      "c5": {
        "name": "The Merciful",
        "effect": "Increases the Level of Trail of the Qilin by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "The Clement",
        "effect": "Using Trail of the Qilin causes the next Frostflake Arrow shot within 30s to not require charging."
      }
    },
    {
      "name": "Jean",
      "c1": {
        "name": "Spiraling Tempest",
        "effect": "Increases the pulling speed of Gale Blade after holding for more than 1s, and increases the DMG dealt by 40%."
      },
      "c2": {
        "name": "People's Aegis",
        "effect": "When Jean picks up an Elemental Orb/Particle, all party members have their Movement SPD and ATK SPD increased by 15% for 15s."
      },
      "c3": {
        "name": "When the West Wind Arises",
        "effect": "Increases the level of Dandelion Breeze by 3. The maximum upgrade level is 15."
      },
      "c4": {
        "name": "Lands of Dandelion",
        "effect": "Within the Field created by Dandelion Breeze, all opponents have their Anemo RES decreased by 40%."
      },
      "c5": {
        "name": "Outbursting Gust",
        "effect": "Increases the level of Gale Blade by 3. The maximum upgrade level is 15."
      },
      "c6": {
        "name": "Lion's Fang, Fair Protector of Mondstadt",
        "effect": "Incoming DMG is decreased by 35% within the Field created by Dandelion Breeze. Upon leaving the Dandelion Field, this effect lasts for 3 attacks or 10s."
      }
    },
    {
      "name": "Kaeya",
      "c1": {
        "name": "Excellent Blood",
        "effect": "The CRIT Rate of Kaeya's Normal Attack and Charge Attacks against opponents affected by the Cryo is increased by 15%."
      },
      "c2": {
        "name": "Never-Ending Performance",
        "effect": "With every defeated opponent, the duration of Glacial Waltz is increased by 2.5s, up to a maximum of 15s."
      },
      "c3": {
        "name": "Dance of Frost",
        "effect": "Increases the Level of Frostgnaw by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Frozen Kiss",
        "effect": "Triggers automatically when Kaeya's HP falls below 20%:\n*Creates a shield that absorbs damage equal to 30% of Kaeya's Max HP. Lasts for 20s.\n*This shield absorbs Cryo DMG with 250% efficiency.\n*Can only occur once every 60s."
      },
      "c5": {
        "name": "Frostbiting Embrace",
        "effect": "Increases the level of Glacial Waltz by 3. Max upgrade level is 15."
      },
      "c6": {
        "name": "Glacial Whirlwind",
        "effect": "Glacial Waltz will generate 1 additional icicle, and will regenerate 15 Energy when cast."
      }
    },
    {
      "name": "Keqing",
      "c1": {
        "name": "Thundering Might",
        "effect": "Recasting Stellar Restoration while a Lightning Stiletto is present causes Keqing to deal 50% of her ATK as AoE Electro DMG at the start point and terminus of her Blink."
      },
      "c2": {
        "name": "Keen Extraction",
        "effect": "When Keqing's Normal and Charged Attacks hit opponents affected by Electro, they have a 50% chance of producing an Elemental Particle. This effect can only occur once every 5s"
      },
      "c3": {
        "name": "Foreseen Reformation",
        "effect": "Increases the level of Starward Sword by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Attunement",
        "effect": "For 10s after Keqing triggers an Electro-related Elemental Reaction, her ATK is increased by 25%."
      },
      "c5": {
        "name": "Beckoning Stars",
        "effect": "Increases the level of Stellar Restoration by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Tenacious Star",
        "effect": "When initiating a Normal Attack, a Charged Attack, Elemental Skill or Elemental Burst, Keqing gains a 6% Electro DMG Bonus for 8s. Effects triggered by Normal Attacks, Charged Attacks, Elemental Skills, and Elemental Bursts are considered independent entities."
      }
    },
    {
      "name": "Klee",
      "c1": {
        "name": "Chained Reactions",
        "effect": "Attacks and Skills have a certain chance to summon sparks that bombard opponents, dealing DMG equal to 120% of Sparks 'n' Splash's DMG."
      },
      "c2": {
        "name": "Explosive Frags",
        "effect": "Being hit by Jumpy Dumpty's mines decreases opponents' DEF by 23% for 10s."
      },
      "c3": {
        "name": "Exquisite Compound",
        "effect": "Increases the level of Jumpy Dumpty by 3. Maximum level is 15."
      },
      "c4": {
        "name": "Sparkly Explosion",
        "effect": "If Klee leaves the field during the duration of Sparks 'n' Splash, her departure triggers an explosion that deals 555% of her ATK as AoE Pyro DMG."
      },
      "c5": {
        "name": "Nova Burst",
        "effect": "Increases the level of Sparks 'n' Splash by 3. Maximum level is 15."
      },
      "c6": {
        "name": "Blazing Delight",
        "effect": "While under the effects of Sparks 'n' Splash, other members of the party will continuously regenerate Energy.\nWhen Sparks 'n' Splash is used, all party members will gain a 10% Pyro DMG Bonus for 25s."
      }
    },
    {
      "name": "Lisa",
      "c1": {
        "name": "Infinite Circuit",
        "effect": "Lisa recovers 2 Energy for every opponent hit while holding Violet Arc.\nA maximum of 10 Energy can be regenerated in this manner at any one time."
      },
      "c2": {
        "name": "Electromagnetic Field",
        "effect": "Holding Violet Arc has the following effects:\n*Increases DEF by 25%.\n*Increases Lisa's resistance to interruption."
      },
      "c3": {
        "name": "Resonant Thunder",
        "effect": "Increases the level of Lightning Rose by 3. Maximum level upgrade is 15."
      },
      "c4": {
        "name": "Plasma Eruption",
        "effect": "Increases the number of lightning bolts released by Lightning Rose by 1-3."
      },
      "c5": {
        "name": "Electrocute",
        "effect": "Increases the level of Violet Arc by 3. Maximum level upgrade is 15."
      },
      "c6": {
        "name": "Pulsating Witch",
        "effect": "When Lisa takes the field, she applies 3 stacks of Violet Arc's Conductive status onto nearby opponents.\nThis effect can only occur once every 5s."
      }
    },
    {
      "name": "Mona",
      "c1": {
        "name": "Prophecy of Submersion",
        "effect": "The effects of Hydro-related Elemental Reactions are enhanced for 8s after any of your characters in the party hit an opponent affected by an Omen:\n*Electro-Charged DMG is increased by 15%.\n*Vaporize DMG is increased by 15%.\n*Hydro Swirl DMG is increased by 15%.\n*The duration for which enemies are Frozen is increased by 15%."
      },
      "c2": {
        "name": "Lunar Chain",
        "effect": "When a Normal Attack hits, there is a 20% chance that it will be automatically followed by a Charged Attack. This effect can only occur once every 5s."
      },
      "c3": {
        "name": "Restless Revolution",
        "effect": "Increases the Level of Stellaris Phantasm by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Prophecy of Oblivion",
        "effect": "When any character in the party attacks an opponent affected by the Omen status effect, their CRIT Rate is increased by 15%."
      },
      "c5": {
        "name": "Mockery of Fortuna",
        "effect": "Increase the Level of Mirror Reflection of Doom by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Rhetorics of Calamitas",
        "effect": "Upon entering Illusory Torrent, Mona gains a 60% increase to the DMG her next Charged Attack per second of movement. A maximum DMG Bonus of 180% can be achieved in this manner. The effect lasts for no more than 8s."
      }
    },
    {
      "name": "Nigguang",
      "c1": {
        "name": "Piercing Fragments",
        "effect": "When a Normal Attack hits, it deals AoE DMG."
      },
      "c2": {
        "name": "Shock Effect",
        "effect": "When Jade Screen is shattered, its CD will reset. This effect can only take place every 6 seconds."
      },
      "c3": {
        "name": "Majesty be the Array of Stars",
        "effect": "Increases Starshatter's skill level by 3. Max level is 15."
      },
      "c4": {
        "name": "Exquisite be the Jade, Outshining All Beneath",
        "effect": "Allies within a 10m radius of the Jade Screen take 10% less Elemental DMG."
      },
      "c5": {
        "name": "Invincible be the Jade Screen",
        "effect": "Increases Jade Screen's skill level by 3. Max level is 15."
      },
      "c6": {
        "name": "Invincible be the Jade Screen",
        "effect": "When Starshatter is used, Ningguang gains 7 Star Jades."
      }
    },
    {
      "name": "Noelle",
      "c1": {
        "name": "I Got Your Back",
        "effect": "While Sweeping Time and Breastplate are both in effect, attacks hits have a 100% chance to trigger Breastplate's healing effects."
      },
      "c2": {
        "name": "Combat Maid",
        "effect": "Decreases Noelle's Stamina Consumption of Charged Attacks by 20% and increases Charged Attack DMG by 15%."
      },
      "c3": {
        "name": "Invulnerable Maid",
        "effect": "Increases Breastplate's skill level by 3. Max level is 15"
      },
      "c4": {
        "name": "To Be Cleaned",
        "effect": "When Breastplate ends or shatters, it deals 400% of ATK as Geo DMG to surrounding opponents."
      },
      "c5": {
        "name": "Favonius Sweeper Master",
        "effect": "Increases Sweeping Time's skill level by 3. Max level is 15."
      },
      "c6": {
        "name": "Must Be Spotless",
        "effect": "Sweeping Time increases ATK by an additional 50% of Noelle's DEF. For the skill's duration, adds 1s duration time per opponent defeated, up to 10s."
      }
    },
    {
      "name": "Qiqi",
      "c1": {
        "name": "Ascetics of Frost",
        "effect": "When the Herald of Frost hits an opponent marked by a Fortune-Preserving Talisman, Qiqi regenerates 2 energy."
      },
      "c2": {
        "name": "Frozen to the Bone",
        "effect": "Qiqi's Normal and Charge Attack DMG against opponents affected by Cryo is increased by 15%."
      },
      "c3": {
        "name": "Ascendant Praise",
        "effect": "Increase the Level of Adeptus Art: Preserver of Fortune by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Divine Suppression",
        "effect": "Targets marked by the Fortune-Preserving Talisman have their ATK decreased by 20%."
      },
      "c5": {
        "name": "Crimson Lotus Bloom",
        "effect": "Increases the Level of Adeptus Art: Herald of Frost by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Rite of Resurrection",
        "effect": "Using Adeptus Art: Preserver of Fortune revives all nearby fallen party members and regenerates 50% of their HP.\n*This effect can only occur once every 15 mins."
      }
    },
    {
      "name": "Razor",
      "c1": {
        "name": "Wolf's Instinct",
        "effect": "Picking up an Elemental Orb or Particle increases Razor's DMG by 10% for 8s."
      },
      "c2": {
        "name": "Suppression",
        "effect": "Increases CRIT Rate against opponents with less than 30% HP by 10%."
      },
      "c3": {
        "name": "Soul Companion",
        "effect": "Increases the level of Lightning Fang by 3. Maximum level is 15."
      },
      "c4": {
        "name": "Bite",
        "effect": "When casting Claw and Thunder (Press), opponents hit will have their DEF decreased by 15% for 7s."
      },
      "c5": {
        "name": "Sharpened Claws",
        "effect": "Increases the level of Claw and Thunder by 3. Maximum level is 15."
      },
      "c6": {
        "name": "Lupus Fulguris",
        "effect": "Every 10s, Razor's sword charges up, causing the next Normal Attack to release lightning that deals 100% of Razor's ATK as Electro DMG. When Razor is not using Lightning Fang, a lightning strike on an opponent will grant Razor an Electro Sigil for Claw and Thunder"
      }
    },
    {
      "name": "Sucrose",
      "c1": {
        "name": "Clustered Vacuum Field",
        "effect": "Astable Anemohypostasis Creation - 6308 gains 1 additional charge."
      },
      "c2": {
        "name": "Beth: Unbound Form",
        "effect": "The duration of Forbidden Creation - Isomer 75 / Type II is increased by 2s."
      },
      "c3": {
        "name": "Flawless Alchemistress",
        "effect": "Increases the Level of Astable Anemohypostasis Creation - 6308 by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Alchemania",
        "effect": "Every 7 Normal and Charged Attacks, Sucrose will reduce the CD of Astable Anemohypostasis Creation - 6308 by 1~7s."
      },
      "c5": {
        "name": "Caution: Standard Flask",
        "effect": "Increases the Level of Forbidden Creation - Isomer 75 / Type II by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Chaotic Entropy",
        "effect": "If Forbidden Creation - Isomer 75 / Type II triggers an Elemental Absorption, all party members gain a 20% Elemental DMG Bonus for the corresponding absorbed element during its duration."
      }
    },
    {
      "name": "Tartaglia",
      "c1": {
        "name": "Foul Legacy: Tide Withholder",
        "effect": "Decrease the CD of Foul Legacy: Raging Tide by 20%"
      },
      "c2": {
        "name": "Foul Legacy: Understream",
        "effect": "When opponents affected by Riptide are defeated. Tartaglia regenerates 4 Elemental Energy."
      },
      "c3": {
        "name": "Abyssal Mayhem: Vortex of Turmoil",
        "effect": "Increases the Level of Foul Legacy: Raging Tide by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Abyssal Mayhem: Hydrosprout",
        "effect": "If Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, triggers Riptide Slash against opponents on the field affected by Riptide every 4s, otherwise, triggers Riptide Flash.\nRiptide Slashes and Riptide Flashes triggered by this Constellation effect are not subject to the time intervals that would typically apply to these two Riptide effects, nor do they have any effects on those time intervals."
      },
      "c5": {
        "name": "Havoc: Formless Blade",
        "effect": "Increases the level of Havoc: Obliteration by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Havoc: Annihilation",
        "effect": "When Havoc: Obliteration is cast in Melee stance, the CD of Foul Legacy: Raging Tide is reset. This effect will only take place once Tartaglia returns to his Ranged Stance."
      }
    },
    {
      "name": "Traveler Anemo",
      "c1": {
        "name": "Raging Vortex",
        "effect": "Palm Vortex pulls in enemies within a 5m radius."
      },
      "c2": {
        "name": "Uprising Whirlwind",
        "effect": "Increases Energy Recharge by 16%."
      },
      "c3": {
        "name": "Sweeping Gust",
        "effect": "Increases the level of Gust Surge by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Cherishing Breezes",
        "effect": "Reduces DMG taken while casting Palm Vortex by 10%."
      },
      "c5": {
        "name": "Vortex Stellaris",
        "effect": "Increases the level of Palm Vortex by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Intertwined Winds",
        "effect": "Targets who take DMG from Gust Surge have their Anemo RES decreased by 20%.\nIf an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%."
      }
    },
    {
      "name": "Traveler Geo",
      "c1": {
        "name": "Invincible Stonewalln",
        "effect": "Party members within the radius of Wake of Earth have their CRIT Rate increased by 10% and have increased resistance against interruption."
      },
      "c2": {
        "name": "Rockcore Meltdown",
        "effect": "When the meteorite created by Starfell Sword is destroyed, it will also explode, dealing additional AoE Geo DMG equal to the amount of damage dealt by Starfell Sword."
      },
      "c3": {
        "name": "Will of the Rock",
        "effect": "Increases the level of Wake of Earth by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Reaction Force",
        "effect": "The shockwave triggered by Wake of Earth regenerates 5 Energy for every enemy hit. A maximum of 25 Energy can be recovered in this manner."
      },
      "c5": {
        "name": "Meteorite Impact",
        "effect": "Increases the level of Starfell Sword by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Everlasting Boulder",
        "effect": "The barrier created by Wake of Earth lasts 5s longer. The meteorite created by Starfell Sword lasts 10s longer."
      }
    },
    {
      "name": "Venti",
      "c1": {
        "name": "Splitting Gales",
        "effect": "Fires 2 additional split arrows per Aimed Shot, each dealing 33% of the original arrow's DMG.\nThe additional arrows are fired in a 30° horizontal cone (each 15° to left and right), possibly hitting and damaging the same target in close range. Each arrow has its own critical."
      },
      "c2": {
        "name": "Breeze of Reminiscence",
        "effect": "Skyward Sonnet decreases opponents' Anemo RES and Physical RES by 12% for 10s. Opponents launched by Skyward Sonnet suffer an additional 12% Anemo RES and Physical RES decrease while airborne."
      },
      "c3": {
        "name": "Ode to Thousand Winds",
        "effect": "Increases the level of Wind's Grand Ode by 3. The maximum upgrade level is 15."
      },
      "c4": {
        "name": "Hurricane of Freedom",
        "effect": "When Venti picks up an Elemental Orb or Particle, he receives a 25% Anemo DMG Bonus for 10s."
      },
      "c5": {
        "name": "Concerto dal Cielo",
        "effect": "Increases the level of Skyward Sonnet by 3. The maximum upgrade level is 15."
      },
      "c6": {
        "name": "Storm of Defiance",
        "effect": "Targets who take DMG from Wind's Grand Ode have their Anemo RES decreased by 20%. If an Elemental Absorption occurred, their RES towards the corresponding Element is also decreased by 20%."
      }
    },
    {
      "name": "Xiangling",
      "c1": {
        "name": "Crispy Outside, Tender Inside",
        "effect": "Opponents hit by Guoba's attacks have their Pyro RES reduced by 15% for 6s."
      },
      "c2": {
        "name": "Oil Meets Fire",
        "effect": "The last attack in Normal Attack sequence applies the Implode status onto the opponent for 2s. An explosion will occur once this duration ends, dealing 75% of Xiangling's ATK as AoE Pyro DMG."
      },
      "c3": {
        "name": "Deepfry",
        "effect": "Increases the level of Pyronado by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Slowbake",
        "effect": "Pyronado's duration is increased by 40%."
      },
      "c5": {
        "name": "Guoba Mad",
        "effect": "Increases the level of Guoba Attack by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Condensed Pyronado",
        "effect": "For the duration of Pyronado, all party members receive a 15% Pyro DMG Bonus."
      }
    },
    {
      "name": "Xiao",
      "c1": null,
      "c2": null,
      "c3": null,
      "c4": null,
      "c5": null,
      "c6": null
    },
    {
      "name": "Xingqiu",
      "c1": {
        "name": "The Scent Remained",
        "effect": "Increases the maximum number of Rain Swords by 1."
      },
      "c2": {
        "name": "Rainbow Upon the Azure Sky",
        "effect": "Extends the duration of Guhua Sword: Raincutter by 3s. Decreases the Hydro RES of opponents hit by sword rain by 15% for 4s."
      },
      "c3": {
        "name": "Weaver of Verses",
        "effect": "Increases the level of Guhua Sword: Raincutter by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Evilsoother",
        "effect": "Throughout the duration of Guhua Sword: Raincutter, the DMG dealt by Guhua Sword: Fatal Rainscreen is increased by 50%."
      },
      "c5": {
        "name": "Embrace of Rain",
        "effect": "Increases the level of Guhua Sword: Fatal Rainscreen by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Hence, Call Them My Own Verses",
        "effect": "Activating 2 of Guhua Sword: Raincutter's sword rain attacks greatly increases the DMG of the third. Xingqiu regenerates 3 Energy when sword rain attacks hit opponents."
      }
    },
    {
      "name": "Xinyan",
      "c1": {
        "name": "Fatal Acceleration",
        "effect": "Upon scoring a CRIT hit, increases ATK SPD of Xinyan's Normal and Charged Attacks by 12% for 5s. Can only occur once every 5s."
      },
      "c2": {
        "name": "Impromptu Opening",
        "effect": "Riff Revolution Physical DMG has its Crit rate increased by 100%, and will form a shield at Shield Level 3: Rave when cast."
      },
      "c3": {
        "name": "Double-Stop",
        "effect": "Increases the Level of Sweeping Fervor by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Wildfire Rhythm",
        "effect": "Sweeping Fervor's swing DMG decreases opponent's Physical RES by 15% for 12s."
      },
      "c5": {
        "name": "Screamin' for an Encore",
        "effect": "Increases the Level of Riff Revolution by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Rockin' in a Flaming World",
        "effect": "Decrease the Stamina Consumption of Xinyan Charged Attacks by 30%. Additionally, Xinyan's Charged Attacks gain an ATK bonus equal to 50% of her DEF."
      }
    },
    {
      "name": "Zhongli",
      "c1": {
        "name": "Rock, the Backbone of Earth",
        "effect": "Increases the maximum number of Stone Steles created by Dominus Lapidis that may exist simultaneously to 2."
      },
      "c2": {
        "name": "Stone, the Cradle of Jade",
        "effect": "Planet Befall grants nearby characters on the field a Jade Shield when it descends."
      },
      "c3": {
        "name": "Jade, Shimmering through Darkness",
        "effect": "Increases the Level of Dominus Lapidis by 3. Maximum upgrade level is 15."
      },
      "c4": {
        "name": "Topaz, Unbreakable and Fearless",
        "effect": "Increases Planet Befall's AoE by 20% and increases the duration of Planet Befall's Petrification effect by 2s."
      },
      "c5": {
        "name": "Lazuli, Herald of the Order",
        "effect": "Increases the Level of Planet Befall by 3. Maximum upgrade level is 15."
      },
      "c6": {
        "name": "Chrysos, Bounty of Dominator",
        "effect": "When the Jade Shield takes DMG, 40% of that incoming DMG is converted to HP for the current character. A single instance of regeneration cannot exceed 8% of that character's Max HP."
      }
    }
  ]
}
